import React from 'react';

import learning1 from '../../assets/images/learningPage/Learning1.png';
import learning2 from '../../assets/images/learningPage/Learning2.png';
import learning3 from '../../assets/images/learningPage/Learning3.png';
import learning4 from '../../assets/images/learningPage/Learning4.png';
import learning5 from '../../assets/images/learningPage/Learning5.png';
import learning6 from '../../assets/images/learningPage/Learning6.png';
import learning7 from '../../assets/images/learningPage/Learning7.png';
import learning8 from '../../assets/images/learningPage/Learning8.png';
import learning9 from '../../assets/images/learningPage/Learning9.png';
import learning10 from '../../assets/images/learningPage/Learning10.png';
import learning11 from '../../assets/images/learningPage/Learning11.png';
import learning12 from '../../assets/images/learningPage/Learning12.png';
import styles from './styles.css';

export default function Learning() {
    return (
        <div className={styles.mainDivLearning}>
            <h1>Як зібрати Кубик Рубіка</h1>
            <h2>Як зібрати Кубик Рубіка. Найшвидший і найпростіший спосіб для початківців</h2>
            <p>
                Відразу скажемо, що складання головоломки без інструкції дуже складний процес. Якщо вірити чуткам, то
                самому Ерно Рубіку знадобилося близько 3 місяців, щоб упоратися зі своїм винаходом. Також багато
                залежить від того який кубік 3х3 купити. <br /> Наша інструкція була розроблена викладачами школи
                спідкубінгу, які збирають різні головоломки за лічені секунди. Використовуючи алгоритм нижче, ви зможете
                легко і швидко зробити свою першу збірку. Якщо вам зручніше формат відео, пропонуємо ознайомитись із
                відеоінструкцією.
            </p>
            <h2>Конструкція кубика Рубіка 3х3</h2>
            <p>
                Перш ніж приступити до практики, потрібно розібратися та засвоїти деякі терміни, які будуть зустрічатися
                надалі. Насамперед розберімось з конструкцією кубика 3 на 3. 26 рухомих елементів скріплені між собою та
                утворюють куб, який має 6 різнокольорових сторін. Всі частини головоломки поділяються на 3 типи: центри,
                ребра та кути.
            </p>
            <img className={styles.bigImg} src={learning1} alt="Image-1" />
            <p>рис.1 назви основних елементів кубика Рубіка</p>
            <img src={learning2} alt="Image-2" />
            <p>рис.1 назви основних елементів кубика Рубіка</p>
            <h2>Вчимося читати формули та розуміти мову обертання.</h2>
            <p>
                Після прочитання наступних кількох абзаців ви говоритимете з головоломкою однією мовою і навчитеся
                розуміти свій кубик Рубіка швидко і легко. Зверніть увагу:
            </p>
            <ol>
                <li>
                    Кубик має право, ліво, верх і низ. Під час виконання формули не змінюйте положення кубика щодо себе.
                    Завжди тримайте кубик в тому самому положенні.
                </li>
                <li>
                    У кубику 3х3, як і в інших непарних кубів (5х5, 7х7 ... 17х17) центри утворюють пари і завжди
                    залишаються один навпроти одного. Таким чином, білий центр завжди напроти жовтого, червоний напроти
                    помаранчевого і синій напроти зеленого.
                </li>
            </ol>
            <img src={learning3} alt="Image-3" />
            <p>
                Формули для збирання записуються переважно латинськими літерами. Кожна літера означає поворот певної
                сторони за годинниковою стрілкою. Якщо поруч із літерою намальовано знак, схожий на апостроф, то грань
                потрібно повертати проти годинникової стрілки. Кількість поворотів позначається цифрою. Наприклад,
                формула 2R означає, що потрібно зробити два повороти правої грані за годинниковою стрілкою.
            </p>
            <h2>Перший етап - складання нижнього шару Кубика Рубіка 3х3</h2>
            <p>
                Якщо театр починається з вішалки, то збирання Кубика Рубіка починається з вибору кольору. Виберіть
                кольори, які будуть розташовані зверху і знизу та запам&apos;ятайте їх. Наприклад, ми вирішили, що синій
                колір буде унизу, а зелений угорі. У такому положенні потрібно тримати головоломку до складання першого
                шару.
            </p>
            <h2>Складання правильного хреста на нижній грані кубика.</h2>
            <p>
                Правильним називається хрест, у якому перша сторона ребра збігається за кольором із центром нижньої
                грані, а друга збігається із центром бічної грані. На ілюстрації нижче показано приклад правильного
                складання. <br /> Для збирання правильного хреста не потрібно використовувати складну схему. Вам
                достатньо озброїтися своїм просторовим мисленням, моторикою, і за кілька хвилин ви зможете виконати це
                завдання.
            </p>
            <img src={learning4} alt="Image-4" />
            <h2>Складання кутів</h2>
            <p>
                Після складання хреста переходимо до на складання кутів першого шару. Продовжуємо тримати кубик хрестом
                униз. <br /> Шукаємо потрібний кут. Кути мають три кольори. Один з них має бути синім, а два інших
                повинні відповідати кольорам бічних граней. У нашому випадку ми ставимо синій-жовтий-червоний куточок
                між відповідними центрами.
            </p>
            <ol>
                <li>Знаходимо кут і переміщуємо у верхню грань над місцем, куди він має стати.</li>
                <li>Застосовуємо формулу URU’R’ і повторюємо, доки елемент не стане на місце.</li>
            </ol>
            <p>Переходимо до іншого кута і повторюємо кроки 1-2.</p>
            <img src={learning5} alt="Image-5" />
            <p>
                Цікавий факт: Формула URU&apos;R у народі називається &quot;піф-паф&quot;. Якщо ви зробите 6
                &quot;піф-пафів&quot; поспіль, то кубик спочатку заплутається, а потім повернеться до свого
                першопочаткового стану.
            </p>
            <img src={learning6} alt="Image-6" />
            <h2>Другий етап - складання середнього шару</h2>
            <ol>
                <li>
                    Перед початком складання другого шару тримаємо кубик зібраною стороною донизу. У нашому випадку, це
                    синя грань.
                </li>
                <li>
                    Знаходимо у верхньому шарі будь-яке ребро, яке не має зеленого кольору (центр верхньої грані в
                    нашому випадку).
                </li>
                <li>
                    Повертаємо верхню грань, щоб бічний колір потрібного ребра збігся з центром однієї з бічних граней.
                    На ілюстраціях нижче показаний приклад ситуацій із жовто-червоним ребром. Беремо кубик жовтим або
                    червоним центром до себе і отримуємо один із трьох можливих випадків.
                </li>
            </ol>
            <img src={learning7} alt="Image-7" />
            <h2>Третій випадок</h2>
            <p>
                Ребро стоїть на своєму місці, але кольори не відповідають центрам бічних сторін. Тоді потрібне ребро
                необхідно &quot;вибити&quot; будь-яким ребром, що має зелений колір. Після того, як правильне ребро
                повернулося на верхній шар, приводимо кубик до вищеописаних ситуацій і ставимо на місце.
            </p>
            <img src={learning8} alt="Image-8" />
            <h2>Третій етап - складання верхнього шару. Збираємо хрест</h2>
            <p>
                Складання останнього шару, як і першого, починається з хреста. Перед початком складання на кубику може
                виникнути одна з чотирьох ситуацій, зображених на малюнку нижче. Знайдіть вашу та за допомогою алгоритму
                FRUR’U’F’ зберіть хрест.
            </p>
            <img src={learning9} alt="Image-9" />
            <p>
                Зверніть увагу, якщо ви починаєте з точки на верхній грані, алгоритм потрібно повторити тричі. Вперше ви
                приведете верхню грань до ситуації з верхнім лівим кутом. Вдруге у вас вийде горизонтальна лінія і лише
                з третьої спроби ви зберете хрест.
                <br /> Важливо! Перед виконанням алгоритму тримайте кубик ідентично тому, як зображено на малюнку.
                Наприклад, якщо у вас на верхній грані ситуація з трьома елементами, що нагадують літеру “Г”, поверніть
                кубик так, щоб елементи знаходилися у верхньому лівому куті від вас (ситуація 2).
            </p>
            <h2>Орієнтуємо ребра</h2>
            <p>
                Покрутіть верхню грань і перегляньте скільки ребер поєднуються з центрами бокових сторін. В ідеалі
                повинні збігатися всі чотири кольори. Якщо чотири не збігаються, шукаємо ситуацію, при якій збігаються
                два сусідні ребра. <br /> Якщо збігаються тільки протилежні, або ви зовсім не знайшли збігів, тоді
                застосуйте алгоритм R U R U R 2 U R U і пошукайте знову. Якщо всі чотири ребра збіглися, переходимо до
                збирання кутів. <br /> Якщо збіглися лише 2 сусідні, тримаємо кубик цими ребрами від нас і вправо.
                Застосовуємо формулу.
            </p>
            <img src={learning10} alt="Image-10" />
            <h2>Ставимо кути на місце</h2>
            <p>
                Якщо куточки стоять на своїх місцях, сміливо переходьте до наступного етапу. Головне, щоб їхні кольори
                збігалися з кольорами центрів верхньої та бічних граней.
            </p>
            <img src={learning11} alt="Image-11" />
            <p>
                Якщо хоча б один елемент не стоїть на своєму місці, поверніть кубик Рубіка так, щоб правильний кут
                дивився на вас і розташовувався в правому верхньому куті фронтальної грані.. Зробіть формулу U R U&apos;
                L&apos; U R&apos; U&apos; L. Якщо ви не знайшли жодного “правильного кута”, зробіть формулу вище з
                будь-якого положення. Вам залишається тільки перекрутити кути, щоб завершити свою першу збірку.
            </p>
            <h2>Орієнтуємо кути</h2>
            <p>
                Щоб зібрати кубик, вам потрібно буде правильно повернути 1, кілька або навіть усі кути останнього шару.
                Для цього використовується алгоритм R&apos;D&apos;RDR&apos;D&apos;RD. Правила застосування:
            </p>
            <ol>
                <li>Алгоритм повертає правий ближній кут.</li>
                <li>Для правильного повороту іноді потрібно кілька застосувань формули.</li>
                <li>Вам здасться, що кубик розбирається, але не звертайте на це увагу.</li>
            </ol>
            <p>
                Коли ви правильно зорієнтуєте перший кут, поверніть верхню грань так, щоб наступний
                &quot;неправильний&quot; кут знаходився в правому ближньому кутку від вас. Повторіть формулу та
                переходьте до наступного кута.
            </p>
            <img src={learning12} alt="Image-12" />
            <p>Випадок з чотирма неправильно орієнтованими кутами (найскладніший):</p>
            <h2>Вітаємо!</h2>
            <p>
                Тепер ви можете збирати кубик Рубіка. Рекомендуємо кілька разів зібрати та розібрати кубик, щоб
                закріпити знання та краще зрозуміти, як працюють формули та принципи складання. Уміння збирати кубик
                Рубіка 3х3 дає можливість спробувати свої сили з безліччю інших механічних головоломок.
            </p>
            <p>
                Коли ви впевнено опануєте складання кубика 3 на 3, рекомендуємо додати до колекції дзеркальний кубик або
                мегамінкс. Також ви завжди можете навчитися збирати головоломку ще швидше. Для цього рекомендуємо
                записатися на заняття із професійними спідкуберами.
            </p>
        </div>
    );
}
