import React from 'react';

import rubiksStudy from '../../assets/images/RubikStudy.jpg';
import styles from './styles.css';

export default function AboutUs() {
    return (
        <div className={styles.mainDiv}>
            <div className={styles.imgDiv}>
                <img className={styles.img} src={rubiksStudy} alt="Rubiks Study" />
                <div>
                    <h2>Хто ми такі?</h2>
                    <p>
                        CubeQuest – це не просто платформа для навчання складанню кубиків Рубика. Це спільнота, яка
                        допомагає вам відчути захоплення від кожного нового кроку в розв&apos;язанні головоломок. Ми
                        створили місце, де кожен, незалежно від рівня досвіду, може пройти свій власний шлях від новачка
                        до справжнього майстра складання кубиків.
                    </p>
                    <p>
                        Ми прагнемо зробити складання кубиків Рубика доступним для кожного, створюючи захопливу подорож,
                        що мотивує користувачів вдосконалювати свої навички через квести, змагання і спілкування в
                        спільноті.
                    </p>
                </div>
            </div>
            <p>
                CubeQuest був створений з ідеєю поєднати навчання та розваги. Спостерігаючи, як багатьом людям не
                вистачає інструментів для легкого і зрозумілого навчання складанню кубика Рубика, ми вирішили створити
                платформу, яка перетворить цей процес на пригоду. Ми віримо, що кожен новий крок у вирішенні головоломки
                – це маленька перемога, і наша мета – зробити ці перемоги доступними для всіх.
            </p>
            <p>
                CubeQuest – це місце, де ви можете не лише навчитися складати кубики Рубика, а й знайти однодумців,
                взяти участь у захопливих змаганнях та отримати задоволення від вирішення складних головоломок.
            </p>
        </div>
    );
}
